import { useEffect, useState } from "react";
import Input from "../../ui/Input";
import CustomDatepicker from "../../ui/CustomDatepicker";
import dayjs from "dayjs";
import AutoComplete from "../../ui/AutoComplete";
import { FontAwesomeIcon } from "@fortawesome/react-fontawesome";
import { useDispatch, useSelector } from "react-redux";
import { useMutation } from "react-query";
import { updateUserbyId } from "../../utilities/Apis";
import CustomButton from "../../ui/CustomButton";
import { updateUser } from "../../redux/UserSlice";
import { toast } from "react-toastify";

const municipalities = [
  //الاول

  "مدينه الرياض",
  "مدينه مكه المكرمه",
  "مدينه المدينه المنوره",
  "مدينه الدمام,الخبر,الظهران",
  "مدينه جده",

  //الثاني

  "مدينه برديه",
  "مدينه حائل",
  "مدينه سكاكا",
  "مدينه الطائف",
  "مدينه ابها",
  "مدينه تبوك",
  "مدينه الباحه",
  "مدينه الهفوف",
  "مدينه جازان",
  "مدينه نجران",
  "مدينه عرعر",
  "مدينه حفر الباطن",

  //الثالث
  " بلدية محافظةالخرج",
  " بلدية محافظة ينبع",
  " بلدية محافظةالقطيف",
  " بلدية محافظة خميس مشيط",
  " بلدية محافظة عنيزة",

  "بلديه محافظه المجمعه",

  "بلدية محافظة شقراء",
  "بلدية محافظة الزلفي",
  "بلدية محافظة الجبيل",
  "بلدية محافظة عفيف",
  "بلدية محافظة الخفجي",
  "بلدية محافظة المذنب",
  "بلدية محافظة وادي الدواسر",
  "بلدية محافظة القويعية",
  "بلدية محافظة بقيق",
  "بلدية محافظة الدوادمي",
  "بلدية محافظة العلا",
  "بلدية محافظة الرس",
  "بلدية محافظة بلجرشي",
  "بلدية محافظة بيشة",
  "بلدية محافظة تيماء",
  "بلدية محافظة ظهران الجنوب",
  "بلدية محافظة صبيا",
  "بلدية محافظة النماص",
  "بلدية محافظة فيفا",
  "بلدية محافظة الدرعية",
  "بلدية محافظة رابغ",
  "بلدية محافظة البكيرية",
  "بلدية محافظة محايل عسير",
  "بلدية محافظة القريات",

  //الرابع

  "بلدية محافظة الأفلاج",
  "بلدية محافظة حوطة بني تميم",
  "بلدية محافظة الغاط",
  "بلدية محافظة السليل",
  "بلدية محافظة ضرماء",
  "بلدية محافظة حريملاء",
  "بلدية محافظة مرات",
  "بلدية محافظة المزاحمية",
  "بلدية محافظة ثادق",
  "بلدية محافظة الحريق",
  "بلدية حوطة سدير",
  "بلدية تمير",
  "بلدية روضة سدير",
  "بلدية جلاجل",
  "بلدية محافظة الرين",
  "بلدية محافظة الدلم",
  "بلدية محافظة الحناكية",
  "بلدية محافظة خيبر",
  "بلدية محافظة بدر",
  "بلدية محافظة القنفذة",
  "بلدية محافظة الليث",
  "بلدية محافظة خليص",
  "بلدية محافظة رأس تنورة",
  "بلدية محافظة النعيرية",
  "بلدية محافظة البدائع",
  "بلدية محافظة الأسياح",
  "بلدية محافظة رياض الخبراء",
  "بلدية الخبراء والسحابين",
  "بلدية محافظة تثليث",
  "بلدية محافظة أحد رفيدة",
  "بلدية محافظة تنومة",
  "بلدية محافظة سراة عبيدة",
  "بلدية محافظة بقعاء",
  "بلدية تربة حائل",
  "بلدية محافظة قلوه",
  "بلدية محافظة المندق",
  "بلدية محافظة ضباء",
  "بلدية محافظة الوجه",
  "بلدية محافظة أملج",
  "بلدية محافظة حقل",
  "بلدية محافظة بيش",
  "بلدية محافظة أبي عريش",
  "بلدية محافظة صامطة",
  "بلدية محافظة شروره",
  "بلدية محافظة دومة الجندل",
  "بلدية محافظة طبرجل",
  "بلدية محافظة رفحاء",
  "بلدية محافظة طريف",
  "بلدية محافظة رنية",
  "بلدية محافظة تربة",
  "بلدية محافظة الخرمة",
  "بلدية محافظة رماح",
  "بلدية الحلوة",
  "بلدية الهياثم",
  "بلدية العيينة والجبيلة",
  "بلدية الرويضة",
  "بلدية ساجر",
  "بلدية البجادية",
  "بلدية نفي",
  "بلدية القصب",
  "بلدية الهدار",
  "بلدية الأرطاوية",
  "بلدية محافظة الجموم",
  "بلدية البصر",
  "بلدية دخنه",
  "بلدية محافظة رجال ألمع",
  "بلدية محافظة المهد",
  "بلدية ينبع النخل",
  "بلدية محافظة الكامل",
  "بلدية القوز (القنفذة)",
  "بلدية محافظة المجاردة",
  "بلدية محافظة قرية العليا",
  "بلدية محافظة طريب",
  "بلدية الرفيعة",
  "بلدية مليجة",
  "بلدية محافظة الحرجة",
  "بلدية بللسمر",
  "بلدية جبة",
  "بلدية الروضة",
  "بلدية الكهفة",
  "بلدية الخطة",
  "بلدية محافظة المخواة",
  "بلدية محافظة العقيق",
  "بلدية محافظة القرى",
  "بلدية الشيال العلم",
  "بلدية محافظة ضريه",
  "بلدية البشائر",
  "بلدية محافظة البدع",
  "بلدية محافظة العارضة",
  "بلدية وادي جازان",
  "بلدية الموسم",
  "بلدية محافظة يدمة",
  "بلدية محافظة حبونا",
  "بلدية سلطانة",
  "بلدية محافظة العويقيلة",
  "بلدية محافظة المويه",
  "بلدية محافظة أحد المسارحة",
  "بلدية يبرين",
  "بلدية محافظة عيون الجواء",
  "بلدية محافظة موقق",
  "بلدية محافظة النبهانية",
  "بلدية محافظة الحائط",
  "بلدية محافظة الشماسية",
  "بلدية محافظة السليمي",
  "بلدية محافظة عقلة الصقور",
  "بلدية محافظة الشملي",
  "بلدية محافظة فرسان",
  "بلدية محافظة وادي الفرع",
  "بلدية محافظة الطوال",
  "بلدية محافظة ضمد",
  "بلدية محافظة بلقرن",
  "بلدية صوير",

  //الخمامس

  "بلدية الحديثة",
  "بلدية شعبة نصاب",
  "بلدية لينه",
  "بلدية طلعة التمياط",
  "بلدية ابن شريم",
  "بلدية روضة هباس",
  "بلدية أم خنصر",
  "بلدية محافظة ميسان",
  "بلدية بني سعد",
  "بلدية المحاني",
  "بلدية قيا",
  "بلدية ظلم",
  "بلدية القريع بن مالك",
  "بلدية سلوى",
  "بلدية البطحاء",
  "بلدية القيصومة",
  "بلدية محافظة الهدومة",
  "بلدية الصداوي",
  "بلدية الذيبية",
  "بلدية محافظة العيص",
  "بلدية أضم",
  "بلدية العرضية الجنوبية",
  "بلدية محافظة سميراء",
  "بلدية الشبحة",
  "بلدية بداء",
  "بلدية أبو راكه",
  "بلدية محافظة الدرب",
  "بلدية محافظة الدائر بني مالك",
  "بلدية محافظة العيدابي",
  "بلدية محافظة هروب",
  "بلدية محافظة الريث",
  "بلدية الخوبه",
  "بلدية الشقيق",
  "بلدية السهي",
  "بلدية الحقو",
  "بلدية الحكامية",
  "بلدية العالية",
  "بلدية القفل",
  "بلدية قوز الجعافره",
  "بلدية محافظة بدر الجنوب",
  "بلدية محافظة ثار",
  "بلدية محافظة خباش",
  "بلدية الوديعة",
  "بلدية الحصينية",
  "بلدية بئر عسكر",
  "بلدية العيساوية",
  "بلدية أبو عجرم",
  "بلدية الناصفة",
  "بلدية زلوم",
  "بلدية باللحمر",
  "بلدية الفرشة",
  "بلدية قنا",
  "بلدية الصبيخة",
  "بلدية بني عمرو",
  "بلدية صمخ",
  "بلدية النقيع",
  "بلدية الثنية وتبالة",
  "بلدية محافظة الأمواه",
  "بلدية الواديين",
  "بلدية الساحل",
  "بلدية محافظة الشنان",
  "بلدية محافظة الغزالة",
  "بلدية الحليفة السفلى",
  "بلدية فيد",
  "بلدية الأجفر",
  "بلدية انبوان",
  "بلدية محافظة الحجرة",
  "بلدية محافظة غامد الزناد",
  "بلدية محافظة بني حسن",
  "بلدية بني كبير",
  "بلدية معشوقة",
  "بلدية بير بن هرماس",
  "بلدية القليبة",
  "بلدية شواق",
  "بلدية المنجور",
  "بلدية سبت الجارة",
  "بلدية غميقة",
  "بلدية الصرار",
  "بلدية اللهابة",
  "بلدية عريعره",
  "بلدية القليب",
  "بلدية جوف بني هاجر",
  "بلدية عين دار",
  "بلدية القوارة",
  "بلدية قبة",
  "بلدية أبانات ضليع رشيد",
  "بلدية الفوارة",
  "بلدية العمار",
  "بلدية قصيباء",
  "بلدية شري",
  "بلدية الفويلق",
  "بلدية قصر ابن عقيل",
  "بلدية الدليمية",
  "بلدية البطين",
  "بلدية الظاهرية",
  "بلدية محافظة بارق",
  "بلدية محافظة البرك",
  "بلدية بحر أبو سكينه",
  "بلدية وادي بن هشبل",
  "بلدية الربوعة",
  "بلدية الحازمي",
  "بلدية الجمش",
  "بلدية أشيقر",
  "بلدية حلبان",
  "بلدية عروى",
  "بلدية الأحمر",
  "بلدية بدائع العضيان",
  "بلدية الحصاة",
  "بلدية الجله وتبراك",
  "بلدية البديع",
  "بلدية الحيانه والبرك",
  "بلدية السر",
  "بلدية عسفان",
  "بلدية مدركة",
  "بلدية الحسو",
  "بلدية النخيل",
  "بلدية المسيجيد والقاحة",
  "بلدية العشاش",
  "بلدية السويرقية",
  "بلدية ثرب",
  "بلدية الصلصلة",
  "بلدية سليلة جهينة والمربع",
  "بلدية حجر",
  "بلدية المظيلف",
  "بلدية الحلى",
  "بلدية الشواق",
  "بلدية العرضية الشمالية",
];
export default function SettingFrom({ currentImage, setCurrentImage }) {
  const user = useSelector((store) => store.user.user);
  const userToken = useSelector((store) => store.user.token);
  const [name, setName] = useState("");
  const [email, setEmail] = useState("");
  const [date, setDate] = useState(dayjs().toDate());
  const [location, setLocation] = useState("");
  const [phone, setPhone] = useState("");
  const dispatch = useDispatch();
  useEffect(() => {
    if (user) {
      setName(user.name || "");
      setEmail(user.email || "");
      setLocation(user.location || "");
      setPhone(user.phone || "");
      setDate(user.birthDate || "");
    }
  }, [user]);

  const { mutate, isError, isLoading } = useMutation({
    mutationKey: ["update_user"],
    mutationFn: () =>
      updateUserbyId(
        {
          name,
          email,
          location,
          phone,
          birthDate: date,
          image: currentImage,
        },
        userToken
      ),

    onSuccess: (e) => {
      dispatch(updateUser(e));
      setCurrentImage(null);
    },
    onError: (error) => {
      toast.error(error.response.data.message);
    },
  });
  if (isError) {
    console.log(isError);
  }

  if (isLoading) return "zzzzzzzzzz";

  return (
    <div>
      <form className="flex flex-wrap gap-y-3 flex-row-reverse justify-center gap-x-5 w-full py-5">
   <div className="flex flex-wrap gap-3">
         <div className="w-full md:w-[500px]">
          <Input
            divDeco="w-full"
            deco="w-full h-12" // 48px height
            name="name"
            value={name}
            onChange={(e) => setName(e.target.value)}
            label="الاسم"
          />
        </div>

        <div className="w-full md:w-[500px]">
          <Input
            divDeco="w-full"
            deco="w-full h-12"
            name="email"
            value={email}
            onChange={(e) => setEmail(e.target.value)}
            label="البريد الالكتروني"
          />
        </div>
   </div>

      <div className="flex flex-wrap items-center gap-3">
          <div className="w-full md:w-[500px]">
          <Input
            divDeco="w-full"
            deco="w-full h-12"
            name="phone"
            value={phone}
            onChange={(e) => {
              if (!isNaN(+e.target.value)) {
                setPhone(e.target.value);
              }
            }}
            label="رقم المحمول"
          />
        </div>
        <div className="w-full md:w-[500px]">
          <AutoComplete
            deco="w-full"
            options={municipalities}
            value={location}
            onchange={(event, newValue) => setLocation(newValue)}
            label="العنوان"
          />
        </div>
      </div>
        <div className="w-full flex flex-col items-center gap-y-3">
          <div className="w-full md:w-[500px] bg-[#AEB9E1] text-white flex items-center justify-between">
            <span className="px-3">
              . نحن نحافظ على خصوصية بياناتك ولا نشاركها أبدًا مع أطراف ثالثة
            </span>
            <span className="bg-[#97a6de] py-2 px-3">
              <FontAwesomeIcon icon="fa-solid fa-lock" />
            </span>
          </div>
        </div>
      </form>
      <div className="flex items-center gap-x-2">
        <CustomButton
          onclick={() => console.log()}
          text={"حذف"}
          deco={
            " border-[1px] border-red-500  text-red-500  py-2 px-10 rounded-lg "
          }
        />
        <CustomButton
          onclick={mutate}
          text={"حفظ التعديلات"}
          deco={
            "bg-primary py-2 px-3 border-[1px] border-primary rounded-lg text-white"
          }
        />
      </div>
    </div>
  );
}
